tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
tap "espanso/espanso"

brew "the_silver_searcher" # ag
brew "bash"
# brew "colordiff"
brew "espanso" # open source text expander
# brew "findutils"
brew "fswatch" # for watching changes in folders
brew "git"
brew "gnu-sed"
brew "gnu-tar"
# brew "htop"
# brew "hub"
# brew "kubernetes-helm"
brew "mas"
brew "nmap"
# brew "pigz"
# brew "rename"
# brew "rsync"
brew "tesseract" # extract text from images
brew "watch"
brew "wget"
brew "yarn"

cask "1password"
cask "brave-browser"
cask "docker"
cask "dropbox"
cask "flux"
# cask "google-cloud-sdk"
cask "google-chrome"
cask "istat-menus"
cask "little-snitch"
cask "mactex"
cask "mullvadvpn"
cask "signal"
cask "spotify"
# cask "station"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"
cask "warp"

mas "Slack", id: 803453959
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
mas "Bear", id: 1091189122
