tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"

brew "the_silver_searcher" # ag
brew "bash"
brew "caddy"
brew "colordiff"
brew "findutils"
brew "fswatch" # for watching changes in folders
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "htop"
brew "hub"
brew "inetutils" # for ftp command line tool
brew "kubernetes-helm"
brew "mas"
brew "mysql"
brew "nmap"
brew "pigz"
brew "python" # for pip / jinja2
brew "redis"
brew "rename"
brew "rsync"
brew "tesseract" # extract text from images
brew "watch"
brew "watchman" # for react-native
brew "wget"
brew "yarn"

cask "1password"
cask "alfred"
cask "docker"
cask "dropbox"
cask "expressvpn"
cask "flux"
cask "google-cloud-sdk"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "little-snitch"
cask "mactex"
cask "react-native-debugger"
cask "sourcetree"
cask "sequel-pro"
cask "signal"
cask "skype"
cask "spotify"
cask "station"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"

mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
mas "Bear", id: 1091189122
